Revit 2024 API
Category.IsVisibleInUI Property
 Identifies if the category is visible to the user and should be displayed in UI.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020
Syntax
C#
public bool IsVisibleInUI { get; }
Visual Basic
Public ReadOnly Property IsVisibleInUI As Boolean
	Get
Visual C++
public:
property bool IsVisibleInUI {
	bool get ();
}
Field Value
 True if the category should be displayed in UI.
See Also
Category Class
Autodesk.Revit.DB Namespace